MikroElektronika/core_packages/PIC/XC8/def/PIC12F1612/mcu.h
#define                                 CRCDAT13_bit        _BIT_ACCESS(CRCDATH,5)
// CRCDATH<CRCDAT14>
extern volatile __bit                   CRCDAT14            __at(0x3C96);	// @ (0x792 * 8 + 6)
#define                                 CRCDAT14_bit        _BIT_ACCESS(CRCDATH,6)
// CRCDATH<CRCDAT15>
extern volatile __bit                   CRCDAT15            __at(0x3C97);	// @ (0x792 * 8 + 7)
#define                                 CRCDAT15_bit        _BIT_ACCESS(CRCDATH,7)
// CRCDATL<CRCDAT2>
extern volatile __bit                   CRCDAT2             __at(0x3C8A);	// @ (0x791 * 8 + 2)
#define                                 CRCDAT2_bit         _BIT_ACCESS(CRCDATL,2)
// CRCDATL<CRCDAT3>
extern volatile __bit                   CRCDAT3             __at(0x3C8B);	// @ (0x791 * 8 + 3)
#define                                 CRCDAT3_bit         _BIT_ACCESS(CRCDATL,3)
// CRCDATL<CRCDAT4>
extern volatile __bit                   CRCDAT4             __at(0x3C8C);	// @ (0x791 * 8 + 4)
#define                                 CRCDAT4_bit         _BIT_ACCESS(CRCDATL,4)
// CRCDATL<CRCDAT5>
extern volatile __bit                   CRCDAT5             __at(0x3C8D);	// @ (0x791 * 8 + 5)
#define                                 CRCDAT5_bit         _BIT_ACCESS(CRCDATL,5)
// CRCDATL<CRCDAT6>
extern volatile __bit                   CRCDAT6             __at(0x3C8E);	// @ (0x791 * 8 + 6)
#define                                 CRCDAT6_bit         _BIT_ACCESS(CRCDATL,6)
// CRCDATH<CRCDAT8>
extern volatile __bit                   CRCDAT8             __at(0x3C90);	// @ (0x792 * 8 + 0)
#define                                 CRCDAT8_bit         _BIT_ACCESS(CRCDATH,0)
// CRCDATH<CRCDAT9>
extern volatile __bit                   CRCDAT9             __at(0x3C91);	// @ (0x792 * 8 + 1)
#define                                 CRCDAT9_bit         _BIT_ACCESS(CRCDATH,1)
// CRCCON1<CRCDLEN0>
extern volatile __bit                   CRCDLEN0            __at(0x3CD4);	// @ (0x79A * 8 + 4)
#define                                 CRCDLEN0_bit        _BIT_ACCESS(CRCCON1,4)
// CRCCON1<CRCDLEN1>
extern volatile __bit                   CRCDLEN1            __at(0x3CD5);	// @ (0x79A * 8 + 5)
#define                                 CRCDLEN1_bit        _BIT_ACCESS(CRCCON1,5)
// CRCCON1<CRCDLEN2>
extern volatile __bit                   CRCDLEN2            __at(0x3CD6);	// @ (0x79A * 8 + 6)
#define                                 CRCDLEN2_bit        _BIT_ACCESS(CRCCON1,6)
// CRCCON1<CRCDLEN3>
extern volatile __bit                   CRCDLEN3            __at(0x3CD7);	// @ (0x79A * 8 + 7)
#define                                 CRCDLEN3_bit        _BIT_ACCESS(CRCCON1,7)
// CRCCON0<CRCEN>
extern volatile __bit                   CRCEN               __at(0x3CCF);	// @ (0x799 * 8 + 7)
#define                                 CRCEN_bit           _BIT_ACCESS(CRCCON0,7)
// CRCCON0<CRCFULL>
extern volatile __bit                   CRCFULL             __at(0x3CC8);	// @ (0x799 * 8 + 0)
#define                                 CRCFULL_bit         _BIT_ACCESS(CRCCON0,0)
// CRCCON0<CRCGO>
extern volatile __bit                   CRCGO               __at(0x3CCE);	// @ (0x799 * 8 + 6)
#define                                 CRCGO_bit           _BIT_ACCESS(CRCCON0,6)
// PIE4<CRCIE>
extern volatile __bit                   CRCIE               __at(0x4A6);	// @ (0x94 * 8 + 6)
#define                                 CRCIE_bit           _BIT_ACCESS(PIE4,6)
// PIR4<CRCIF>
extern volatile __bit                   CRCIF               __at(0xA6);	// @ (0x14 * 8 + 6)
#define                                 CRCIF_bit           _BIT_ACCESS(PIR4,6)
// CRCCON1<CRCPLEN0>
extern volatile __bit                   CRCPLEN0            __at(0x3CD0);	// @ (0x79A * 8 + 0)
#define                                 CRCPLEN0_bit        _BIT_ACCESS(CRCCON1,0)
// CRCCON1<CRCPLEN1>
extern volatile __bit                   CRCPLEN1            __at(0x3CD1);	// @ (0x79A * 8 + 1)
#define                                 CRCPLEN1_bit        _BIT_ACCESS(CRCCON1,1)
// CRCCON1<CRCPLEN2>
extern volatile __bit                   CRCPLEN2            __at(0x3CD2);	// @ (0x79A * 8 + 2)
#define                                 CRCPLEN2_bit        _BIT_ACCESS(CRCCON1,2)
// CRCCON1<CRCPLEN3>
extern volatile __bit                   CRCPLEN3            __at(0x3CD3);	// @ (0x79A * 8 + 3)
#define                                 CRCPLEN3_bit        _BIT_ACCESS(CRCCON1,3)
// CRCSHIFTL<CRCSHIFT0>
extern volatile __bit                   CRCSHIFT0           __at(0x3CA8);	// @ (0x795 * 8 + 0)
#define                                 CRCSHIFT0_bit       _BIT_ACCESS(CRCSHIFTL,0)
// CRCSHIFTL<CRCSHIFT1>
extern volatile __bit                   CRCSHIFT1           __at(0x3CA9);	// @ (0x795 * 8 + 1)
#define                                 CRCSHIFT1_bit       _BIT_ACCESS(CRCSHIFTL,1)
// CRCSHIFTH<CRCSHIFT10>
extern volatile __bit                   CRCSHIFT10          __at(0x3CB2);	// @ (0x796 * 8 + 2)
#define                                 CRCSHIFT10_bit      _BIT_ACCESS(CRCSHIFTH,2)
// CRCSHIFTH<CRCSHIFT11>
extern volatile __bit                   CRCSHIFT11          __at(0x3CB3);	// @ (0x796 * 8 + 3)
#define                                 CRCSHIFT11_bit      _BIT_ACCESS(CRCSHIFTH,3)
// CRCSHIFTH<CRCSHIFT12>
extern volatile __bit                   CRCSHIFT12          __at(0x3CB4);	// @ (0x796 * 8 + 4)
#define                                 CRCSHIFT12_bit      _BIT_ACCESS(CRCSHIFTH,4)
// CRCSHIFTH<CRCSHIFT13>
extern volatile __bit                   CRCSHIFT13          __at(0x3CB5);	// @ (0x796 * 8 + 5)
#define                                 CRCSHIFT13_bit      _BIT_ACCESS(CRCSHIFTH,5)
// CRCSHIFTH<CRCSHIFT14>
extern volatile __bit                   CRCSHIFT14          __at(0x3CB6);	// @ (0x796 * 8 + 6)
#define                                 CRCSHIFT14_bit      _BIT_ACCESS(CRCSHIFTH,6)
// CRCSHIFTH<CRCSHIFT15>
extern volatile __bit                   CRCSHIFT15          __at(0x3CB7);	// @ (0x796 * 8 + 7)
#define                                 CRCSHIFT15_bit      _BIT_ACCESS(CRCSHIFTH,7)
// CRCSHIFTL<CRCSHIFT2>
extern volatile __bit                   CRCSHIFT2           __at(0x3CAA);	// @ (0x795 * 8 + 2)
#define                                 CRCSHIFT2_bit       _BIT_ACCESS(CRCSHIFTL,2)
// CRCSHIFTL<CRCSHIFT3>
extern volatile __bit                   CRCSHIFT3           __at(0x3CAB);	// @ (0x795 * 8 + 3)
#define                                 CRCSHIFT3_bit       _BIT_ACCESS(CRCSHIFTL,3)
// CRCSHIFTL<CRCSHIFT4>
extern volatile __bit                   CRCSHIFT4           __at(0x3CAC);	// @ (0x795 * 8 + 4)
#define                                 CRCSHIFT4_bit       _BIT_ACCESS(CRCSHIFTL,4)
// CRCSHIFTL<CRCSHIFT5>
extern volatile __bit                   CRCSHIFT5           __at(0x3CAD);	// @ (0x795 * 8 + 5)
#define                                 CRCSHIFT5_bit       _BIT_ACCESS(CRCSHIFTL,5)
// CRCSHIFTL<CRCSHIFT6>
extern volatile __bit                   CRCSHIFT6           __at(0x3CAE);	// @ (0x795 * 8 + 6)
#define                                 CRCSHIFT6_bit       _BIT_ACCESS(CRCSHIFTL,6)
// CRCSHIFTL<CRCSHIFT7>
extern volatile __bit                   CRCSHIFT7           __at(0x3CAF);	// @ (0x795 * 8 + 7)
#define                                 CRCSHIFT7_bit       _BIT_ACCESS(CRCSHIFTL,7)
// CRCSHIFTH<CRCSHIFT8>
extern volatile __bit                   CRCSHIFT8           __at(0x3CB0);	// @ (0x796 * 8 + 0)
#define                                 CRCSHIFT8_bit       _BIT_ACCESS(CRCSHIFTH,0)
// CRCSHIFTH<CRCSHIFT9>
extern volatile __bit                   CRCSHIFT9           __at(0x3CB1);	// @ (0x796 * 8 + 1)
#define                                 CRCSHIFT9_bit       _BIT_ACCESS(CRCSHIFTH,1)
// CRCCON0<CRCSHIFTM>
extern volatile __bit                   CRCSHIFTM           __at(0x3CC9);	// @ (0x799 * 8 + 1)
#define                                 CRCSHIFTM_bit       _BIT_ACCESS(CRCCON0,1)
// CRCXORL<CRCXOR1>
extern volatile __bit                   CRCXOR1             __at(0x3CB9);	// @ (0x797 * 8 + 1)
#define                                 CRCXOR1_bit         _BIT_ACCESS(CRCXORL,1)
// CRCXORH<CRCXOR10>
extern volatile __bit                   CRCXOR10            __at(0x3CC2);	// @ (0x798 * 8 + 2)
#define                                 CRCXOR10_bit        _BIT_ACCESS(CRCXORH,2)
// CRCXORH<CRCXOR11>
extern volatile __bit                   CRCXOR11            __at(0x3CC3);	// @ (0x798 * 8 + 3)
#define                                 CRCXOR11_bit        _BIT_ACCESS(CRCXORH,3)
// CRCXORH<CRCXOR12>
extern volatile __bit                   CRCXOR12            __at(0x3CC4);	// @ (0x798 * 8 + 4)
#define                                 CRCXOR12_bit        _BIT_ACCESS(CRCXORH,4)
// CRCXORH<CRCXOR13>
extern volatile __bit                   CRCXOR13            __at(0x3CC5);	// @ (0x798 * 8 + 5)
#define                                 CRCXOR13_bit        _BIT_ACCESS(CRCXORH,5)
// CRCXORH<CRCXOR14>
extern volatile __bit                   CRCXOR14            __at(0x3CC6);	// @ (0x798 * 8 + 6)
#define                                 CRCXOR14_bit        _BIT_ACCESS(CRCXORH,6)
// CRCXORH<CRCXOR15>
extern volatile __bit                   CRCXOR15            __at(0x3CC7);	// @ (0x798 * 8 + 7)
#define                                 CRCXOR15_bit        _BIT_ACCESS(CRCXORH,7)
// CRCXORL<CRCXOR2>
extern volatile __bit                   CRCXOR2             __at(0x3CBA);	// @ (0x797 * 8 + 2)
#define                                 CRCXOR2_bit         _BIT_ACCESS(CRCXORL,2)
// CRCXORL<CRCXOR3>
extern volatile __bit                   CRCXOR3             __at(0x3CBB);	// @ (0x797 * 8 + 3)
#define                                 CRCXOR3_bit         _BIT_ACCESS(CRCXORL,3)
// CRCXORL<CRCXOR4>
extern volatile __bit                   CRCXOR4             __at(0x3CBC);	// @ (0x797 * 8 + 4)
#define                                 CRCXOR4_bit         _BIT_ACCESS(CRCXORL,4)
// CRCXORL<CRCXOR5>
extern volatile __bit                   CRCXOR5             __at(0x3CBD);	// @ (0x797 * 8 + 5)
#define                                 CRCXOR5_bit         _BIT_ACCESS(CRCXORL,5)
// CRCXORL<CRCXOR6>
extern volatile __bit                   CRCXOR6             __at(0x3CBE);	// @ (0x797 * 8 + 6)
#define                                 CRCXOR6_bit         _BIT_ACCESS(CRCXORL,6)
// CRCXORL<CRCXOR7>
extern volatile __bit                   CRCXOR7             __at(0x3CBF);	// @ (0x797 * 8 + 7)
#define                                 CRCXOR7_bit         _BIT_ACCESS(CRCXORL,7)
// CRCXORH<CRCXOR8>
extern volatile __bit                   CRCXOR8             __at(0x3CC0);	// @ (0x798 * 8 + 0)
#define                                 CRCXOR8_bit         _BIT_ACCESS(CRCXORH,0)
// CRCXORH<CRCXOR9>
extern volatile __bit                   CRCXOR9             __at(0x3CC1);	// @ (0x798 * 8 + 1)
#define                                 CRCXOR9_bit         _BIT_ACCESS(CRCXORH,1)
// CRCDATL<CRDCDAT7>
extern volatile __bit                   CRDCDAT7            __at(0x3C8F);	// @ (0x791 * 8 + 7)
#define                                 CRDCDAT7_bit        _BIT_ACCESS(CRCDATL,7)
// CWG1CLKCON<CS>
extern volatile __bit                   CS                  __at(0x34C8);	// @ (0x699 * 8 + 0)
#define                                 CS_bit              _BIT_ACCESS(CWG1CLKCON,0)
// CWG1AS1<CWG1C1AS>
extern volatile __bit                   CWG1C1AS            __at(0x34A1);	// @ (0x694 * 8 + 1)
#define                                 CWG1C1AS_bit        _BIT_ACCESS(CWG1AS1,1)
// CWG1AS1<CWG1C2AS>
extern volatile __bit                   CWG1C2AS            __at(0x34A2);	// @ (0x694 * 8 + 2)
#define                                 CWG1C2AS_bit        _BIT_ACCESS(CWG1AS1,2)
// CWG1CLKCON<CWG1CS>
extern volatile __bit                   CWG1CS              __at(0x34C8);	// @ (0x699 * 8 + 0)
#define                                 CWG1CS_bit          _BIT_ACCESS(CWG1CLKCON,0)
// CWG1DBF<CWG1DBF0>
extern volatile __bit                   CWG1DBF0            __at(0x3490);	// @ (0x692 * 8 + 0)
#define                                 CWG1DBF0_bit        _BIT_ACCESS(CWG1DBF,0)
// CWG1DBF<CWG1DBF1>
extern volatile __bit                   CWG1DBF1            __at(0x3491);	// @ (0x692 * 8 + 1)
#define                                 CWG1DBF1_bit        _BIT_ACCESS(CWG1DBF,1)
// CWG1DBF<CWG1DBF2>
extern volatile __bit                   CWG1DBF2            __at(0x3492);	// @ (0x692 * 8 + 2)
#define                                 CWG1DBF2_bit        _BIT_ACCESS(CWG1DBF,2)
// CWG1DBF<CWG1DBF3>
extern volatile __bit                   CWG1DBF3            __at(0x3493);	// @ (0x692 * 8 + 3)
#define                                 CWG1DBF3_bit        _BIT_ACCESS(CWG1DBF,3)
// CWG1DBF<CWG1DBF4>
extern volatile __bit                   CWG1DBF4            __at(0x3494);	// @ (0x692 * 8 + 4)
#define                                 CWG1DBF4_bit        _BIT_ACCESS(CWG1DBF,4)
// CWG1DBF<CWG1DBF5>
extern volatile __bit                   CWG1DBF5            __at(0x3495);	// @ (0x692 * 8 + 5)
#define                                 CWG1DBF5_bit        _BIT_ACCESS(CWG1DBF,5)
// CWG1DBR<CWG1DBR0>
extern volatile __bit                   CWG1DBR0            __at(0x3488);	// @ (0x691 * 8 + 0)
#define                                 CWG1DBR0_bit        _BIT_ACCESS(CWG1DBR,0)
// CWG1DBR<CWG1DBR1>
extern volatile __bit                   CWG1DBR1            __at(0x3489);	// @ (0x691 * 8 + 1)
#define                                 CWG1DBR1_bit        _BIT_ACCESS(CWG1DBR,1)
// CWG1DBR<CWG1DBR2>
extern volatile __bit                   CWG1DBR2            __at(0x348A);	// @ (0x691 * 8 + 2)
#define                                 CWG1DBR2_bit        _BIT_ACCESS(CWG1DBR,2)
// CWG1DBR<CWG1DBR3>
extern volatile __bit                   CWG1DBR3            __at(0x348B);	// @ (0x691 * 8 + 3)
#define                                 CWG1DBR3_bit        _BIT_ACCESS(CWG1DBR,3)
// CWG1DBR<CWG1DBR4>
extern volatile __bit                   CWG1DBR4            __at(0x348C);	// @ (0x691 * 8 + 4)
#define                                 CWG1DBR4_bit        _BIT_ACCESS(CWG1DBR,4)
// CWG1DBR<CWG1DBR5>
extern volatile __bit                   CWG1DBR5            __at(0x348D);	// @ (0x691 * 8 + 5)
#define                                 CWG1DBR5_bit        _BIT_ACCESS(CWG1DBR,5)
// CWG1CON0<CWG1EN>
extern volatile __bit                   CWG1EN              __at(0x34B7);	// @ (0x696 * 8 + 7)
#define                                 CWG1EN_bit          _BIT_ACCESS(CWG1CON0,7)
// CWG1CON1<CWG1IN>
extern volatile __bit                   CWG1IN              __at(0x34BD);	// @ (0x697 * 8 + 5)
#define                                 CWG1IN_bit          _BIT_ACCESS(CWG1CON1,5)
// CWG1AS1<CWG1INAS>
extern volatile __bit                   CWG1INAS            __at(0x34A0);	// @ (0x694 * 8 + 0)
#define                                 CWG1INAS_bit        _BIT_ACCESS(CWG1AS1,0)
// CWG1ISM<CWG1IS0>
extern volatile __bit                   CWG1IS0             __at(0x34D0);	// @ (0x69A * 8 + 0)
#define                                 CWG1IS0_bit         _BIT_ACCESS(CWG1ISM,0)
// CWG1ISM<CWG1IS1>
extern volatile __bit                   CWG1IS1             __at(0x34D1);	// @ (0x69A * 8 + 1)
#define                                 CWG1IS1_bit         _BIT_ACCESS(CWG1ISM,1)
// CWG1ISM<CWG1IS2>
extern volatile __bit                   CWG1IS2             __at(0x34D2);	// @ (0x69A * 8 + 2)
#define                                 CWG1IS2_bit         _BIT_ACCESS(CWG1ISM,2)
// CWG1CON0<CWG1LD>
extern volatile __bit                   CWG1LD              __at(0x34B6);	// @ (0x696 * 8 + 6)
#define                                 CWG1LD_bit          _BIT_ACCESS(CWG1CON0,6)
// CWG1AS0<CWG1LSAC0>
extern volatile __bit                   CWG1LSAC0           __at(0x349A);	// @ (0x693 * 8 + 2)
#define                                 CWG1LSAC0_bit       _BIT_ACCESS(CWG1AS0,2)
// CWG1AS0<CWG1LSAC1>
extern volatile __bit                   CWG1LSAC1           __at(0x349B);	// @ (0x693 * 8 + 3)
#define                                 CWG1LSAC1_bit       _BIT_ACCESS(CWG1AS0,3)
// CWG1AS0<CWG1LSBD0>
extern volatile __bit                   CWG1LSBD0           __at(0x349C);	// @ (0x693 * 8 + 4)
#define                                 CWG1LSBD0_bit       _BIT_ACCESS(CWG1AS0,4)
// CWG1AS0<CWG1LSBD1>
extern volatile __bit                   CWG1LSBD1           __at(0x349D);	// @ (0x693 * 8 + 5)
#define                                 CWG1LSBD1_bit       _BIT_ACCESS(CWG1AS0,5)
// CWG1CON0<CWG1MODE0>
extern volatile __bit                   CWG1MODE0           __at(0x34B0);	// @ (0x696 * 8 + 0)
#define                                 CWG1MODE0_bit       _BIT_ACCESS(CWG1CON0,0)
// CWG1CON0<CWG1MODE1>
extern volatile __bit                   CWG1MODE1           __at(0x34B1);	// @ (0x696 * 8 + 1)
#define                                 CWG1MODE1_bit       _BIT_ACCESS(CWG1CON0,1)
// CWG1CON0<CWG1MODE2>
extern volatile __bit                   CWG1MODE2           __at(0x34B2);	// @ (0x696 * 8 + 2)
#define                                 CWG1MODE2_bit       _BIT_ACCESS(CWG1CON0,2)
// CWG1OCON1<CWG1OEA>
extern volatile __bit                   CWG1OEA             __at(0x34C0);	// @ (0x698 * 8 + 0)
#define                                 CWG1OEA_bit         _BIT_ACCESS(CWG1OCON1,0)
// CWG1OCON1<CWG1OEB>
extern volatile __bit                   CWG1OEB             __at(0x34C1);	// @ (0x698 * 8 + 1)
#define                                 CWG1OEB_bit         _BIT_ACCESS(CWG1OCON1,1)
// CWG1OCON0<CWG1OVRA>
extern volatile __bit                   CWG1OVRA            __at(0x34AC);	// @ (0x695 * 8 + 4)
#define                                 CWG1OVRA_bit        _BIT_ACCESS(CWG1OCON0,4)
// CWG1OCON0<CWG1OVRB>
extern volatile __bit                   CWG1OVRB            __at(0x34AD);	// @ (0x695 * 8 + 5)
#define                                 CWG1OVRB_bit        _BIT_ACCESS(CWG1OCON0,5)
// CWG1OCON0<CWG1OVRC>
extern volatile __bit                   CWG1OVRC            __at(0x34AE);	// @ (0x695 * 8 + 6)
#define                                 CWG1OVRC_bit        _BIT_ACCESS(CWG1OCON0,6)
// CWG1OCON0<CWG1OVRD>
extern volatile __bit                   CWG1OVRD            __at(0x34AF);	// @ (0x695 * 8 + 7)
#define                                 CWG1OVRD_bit        _BIT_ACCESS(CWG1OCON0,7)
// CWG1CON1<CWG1POLA>
extern volatile __bit                   CWG1POLA            __at(0x34B8);	// @ (0x697 * 8 + 0)
#define                                 CWG1POLA_bit        _BIT_ACCESS(CWG1CON1,0)
// CWG1CON1<CWG1POLB>
extern volatile __bit                   CWG1POLB            __at(0x34B9);	// @ (0x697 * 8 + 1)
#define                                 CWG1POLB_bit        _BIT_ACCESS(CWG1CON1,1)
// CWG1CON1<CWG1POLC>
extern volatile __bit                   CWG1POLC            __at(0x34BA);	// @ (0x697 * 8 + 2)
#define                                 CWG1POLC_bit        _BIT_ACCESS(CWG1CON1,2)
// CWG1CON1<CWG1POLD>
extern volatile __bit                   CWG1POLD            __at(0x34BB);	// @ (0x697 * 8 + 3)
#define                                 CWG1POLD_bit        _BIT_ACCESS(CWG1CON1,3)
// CWG1AS0<CWG1REN>
extern volatile __bit                   CWG1REN             __at(0x349E);	// @ (0x693 * 8 + 6)
#define                                 CWG1REN_bit         _BIT_ACCESS(CWG1AS0,6)
// CWG1AS0<CWG1SHUTDOWN>
extern volatile __bit                   CWG1SHUTDOWN        __at(0x349F);	// @ (0x693 * 8 + 7)
#define                                 CWG1SHUTDOWN_bit    _BIT_ACCESS(CWG1AS0,7)
// CWG1OCON0<CWG1STRA>
extern volatile __bit                   CWG1STRA            __at(0x34A8);	// @ (0x695 * 8 + 0)
#define                                 CWG1STRA_bit        _BIT_ACCESS(CWG1OCON0,0)
// CWG1OCON0<CWG1STRB>
extern volatile __bit                   CWG1STRB            __at(0x34A9);	// @ (0x695 * 8 + 1)
#define                                 CWG1STRB_bit        _BIT_ACCESS(CWG1OCON0,1)
// CWG1OCON0<CWG1STRC>
extern volatile __bit                   CWG1STRC            __at(0x34AA);	// @ (0x695 * 8 + 2)
#define                                 CWG1STRC_bit        _BIT_ACCESS(CWG1OCON0,2)
// CWG1OCON0<CWG1STRD>
extern volatile __bit                   CWG1STRD            __at(0x34AB);	// @ (0x695 * 8 + 3)
#define                                 CWG1STRD_bit        _BIT_ACCESS(CWG1OCON0,3)
// CWG1AS1<CWG1TMR2AS>
extern volatile __bit                   CWG1TMR2AS          __at(0x34A4);	// @ (0x694 * 8 + 4)
#define                                 CWG1TMR2AS_bit      _BIT_ACCESS(CWG1AS1,4)
// CWG1AS1<CWG1TMR4AS>
extern volatile __bit                   CWG1TMR4AS          __at(0x34A5);	// @ (0x694 * 8 + 5)
#define                                 CWG1TMR4AS_bit      _BIT_ACCESS(CWG1AS1,5)
// CWG1AS1<CWG1TMR6AS>
extern volatile __bit                   CWG1TMR6AS          __at(0x34A6);	// @ (0x694 * 8 + 6)
#define                                 CWG1TMR6AS_bit      _BIT_ACCESS(CWG1AS1,6)
// APFCON<CWGASEL>
extern volatile __bit                   CWGASEL             __at(0x8EE);	// @ (0x11D * 8 + 6)
#define                                 CWGASEL_bit         _BIT_ACCESS(APFCON,6)
// APFCON<CWGBSEL>
extern volatile __bit                   CWGBSEL             __at(0x8ED);	// @ (0x11D * 8 + 5)
#define                                 CWGBSEL_bit         _BIT_ACCESS(APFCON,5)
// PIE3<CWGIE>
extern volatile __bit                   CWGIE               __at(0x49D);	// @ (0x93 * 8 + 5)
#define                                 CWGIE_bit           _BIT_ACCESS(PIE3,5)
// PIR3<CWGIF>
extern volatile __bit                   CWGIF               __at(0x9D);	// @ (0x13 * 8 + 5)
#define                                 CWGIF_bit           _BIT_ACCESS(PIR3,5)
// STATUS_SHAD<C_SHAD>
extern volatile __bit                   C_SHAD              __at(0x7F20);	// @ (0xFE4 * 8 + 0)
#define                                 C_SHAD_bit          _BIT_ACCESS(STATUS_SHAD,0)
// DAC1CON0<D1PSS0>
extern volatile __bit                   D1PSS0              __at(0x8C2);	// @ (0x118 * 8 + 2)
#define                                 D1PSS0_bit          _BIT_ACCESS(DAC1CON0,2)
// DAC1CON0<D1PSS1>
extern volatile __bit                   D1PSS1              __at(0x8C3);	// @ (0x118 * 8 + 3)
#define                                 D1PSS1_bit          _BIT_ACCESS(DAC1CON0,3)
// DAC1CON0<DAC1EN>
extern volatile __bit                   DAC1EN              __at(0x8C7);	// @ (0x118 * 8 + 7)
#define                                 DAC1EN_bit          _BIT_ACCESS(DAC1CON0,7)
// DAC1CON0<DAC1OE>
extern volatile __bit                   DAC1OE              __at(0x8C5);	// @ (0x118 * 8 + 5)
#define                                 DAC1OE_bit          _BIT_ACCESS(DAC1CON0,5)
// DAC1CON1<DAC1R0>
extern volatile __bit                   DAC1R0              __at(0x8C8);	// @ (0x119 * 8 + 0)
#define                                 DAC1R0_bit          _BIT_ACCESS(DAC1CON1,0)
// DAC1CON1<DAC1R1>
extern volatile __bit                   DAC1R1              __at(0x8C9);	// @ (0x119 * 8 + 1)
#define                                 DAC1R1_bit          _BIT_ACCESS(DAC1CON1,1)
// DAC1CON1<DAC1R2>
extern volatile __bit                   DAC1R2              __at(0x8CA);	// @ (0x119 * 8 + 2)
#define                                 DAC1R2_bit          _BIT_ACCESS(DAC1CON1,2)
// DAC1CON1<DAC1R3>
extern volatile __bit                   DAC1R3              __at(0x8CB);	// @ (0x119 * 8 + 3)
#define                                 DAC1R3_bit          _BIT_ACCESS(DAC1CON1,3)
// DAC1CON1<DAC1R4>
extern volatile __bit                   DAC1R4              __at(0x8CC);	// @ (0x119 * 8 + 4)
#define                                 DAC1R4_bit          _BIT_ACCESS(DAC1CON1,4)
// DAC1CON1<DAC1R5>
extern volatile __bit                   DAC1R5              __at(0x8CD);	// @ (0x119 * 8 + 5)
#define                                 DAC1R5_bit          _BIT_ACCESS(DAC1CON1,5)
// DAC1CON1<DAC1R6>
extern volatile __bit                   DAC1R6              __at(0x8CE);	// @ (0x119 * 8 + 6)
